<template>
  <div class="payment-and-delivery wrapper">
    <h2>Оплата и доставка</h2>
    <p><b>Стоимость доставки в г. Томск и в г. Северск зависит от стоимости товара:</b></p>
    <p>Оплата при получении. Любой товар Икеа обойдется Вам ровно в "цену по каталогу" + "стоимость транспортных услуг"!</p>
    <p><b>*Стоимость указана за наличный расчет</b></p>
    <table class="payment-and-delivery_table">
      <tbody>
        <tr>
          <td>Стоимость покупки</td>
          <td>1 - 9999 руб.</td>
          <td>10000-24999 руб.</td>
          <td>25000-39999 руб.</td>
          <td>40000-300000 руб.</td>
        </tr>
        <tr>
          <td>Транспортные услуги</td>
          <td>13.9 %.</td>
          <td>11.9 %.</td>
          <td>9.9 %.</td>
          <td>7.9 %.</td>
        </tr>
      </tbody>
    </table>
    <p><b>*Стоимость указана за наличный расчет</b></p>
    <p><b>Дополнительные услуги:</b></p>
    <ul>
      <li>Доставка до подъезда  г. Томск и г. Северск (до 18 кг. занос бесплатно) – 249 руб.</li>
      <li>Доставка по Томску и Северску с заносом до 36 кг. - 399 руб.</li>
      <li>Доставка по Томску и Северску с заносом от 37 кг. - 549 руб.</li>
      <li>Доставка в Тимирязево, Просторный, Зональный  – 399 руб.</li>
      <li>Доставка в Асино доплата от 399 руб. в зависимости от объема.</li>
      <li>Доставка в другие удаленные районы по договоренности.</li>
      <li>За особо объёмные или тяжёлые заказы возможна доплата.</li>
    </ul>
    <p><b>Сборка мебели:</b></p>
    <p>Стоимость зависит от сложности и составляет от 8% до 12% от стоимости товаров, которые нужно собрать. Минимум 899 рублей. За серии Бострак, Тодален, Бримнэс и Пакс возможна доплата.</p>
    <p>Установка раковин, смесителей, вырезы в столешнице, подключение встроенной техники, крепление к стенам и др. осуществляется по отдельной договоренности.</p>
    <p><b>Офис приема и выдачи заказов:</b></p>
    <p>г. Томск, пр. Ленина, 166, оф.18а, с 11-00 до 19-00 (пн-пт), с 11-00 до 16-00 (сб-вс).</p>
    <p><b>Сроки доставки:</b></p>
    <p>ОТ 1 ДНЯ.</p>
    <p>* Сроки доставки могут быть увеличены в случае невозможности ее осуществления по причинам не зависящим от нас, к примеру, товара не оказалось в наличии на складе или его перевозка затруднена по каким-либо причинам, то мы заранее уведомляем об этом Заказчика, и по согласованию с Заказчиком доставка переносится на более поздний срок или заказ обнуляется с возвратом денежных средств.</p>
    <p class="payment-and-delivery--accent">Мы работаем по ценам IKEA, мы не занимаемся перепродажей товаров из IKEA, и не делаем никаких наценок на приобретенный вами товар - вы оплачиваете только наши услуги по доставке товаров из IKEA.</p>
  </div>
</template>

<script>
export default {
  
}
</script>

<style lang="sass">
.payment-and-delivery {
  font-family: "Montserrat", -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, "Helvetica Neue", Arial, "Noto Sans", sans-serif, "Apple Color Emoji", "Segoe UI Emoji", "Segoe UI Symbol", "Noto Color Emoji";

  &_table {
    width: 100%;
    border-bottom: 1px solid #dee2e6 !important;
    td {
      border-top: 1px solid #dee2e6;
      padding: 0.75rem;
    }
  }

  &--accent {
    font-size: 18px;
    color: #00416f;
    font-weight: bold;
    background-color: #cce5f7;
    border-color: #b8dbf4;
    padding: 0.75rem 1.25rem;
    border-radius: 3px;
    font-weight: 500;
  }
}
</style>